class pTableForm:
    # -------------------------------------------------------------------------------------------
    SP_BORDER = [
            [0,7,3,3,'bold'], [0,7,1,3,''], [0,8,3,1,''],
            [4,0,1,10,'bold'],[6,0,2,10,'bold'],[9,0,8,10,'bold'],[18,0,14,10,'bold'],[33,0,4,10,'bold'],
            [4,0,1,2,''],[9,0,2,2,''],[11,0,2,2,''], [13,0,4,2,''],
            [4,5,1,2,''],[9,2,2,3,''],[11,2,2,2,''], [13,2,4,5,''],
            [9,5,2,2,''],[11,4,1,3,''], [12,4,1,3,''],[9,7,8,3,''],
            [6,0,1,5,''],[7,0,1,5,''],[6,7,1,3,''],[7,7,1,3,''],[6,0,2,2,''],
            [18,0,2,2,''],[20,0,2,2,''],[22,0,2,2,''],[24,0,4,2,''],[28,0,4,2,''],[33,0,4,2,''],
            [18,2,1,5,''],[19,2,1,5,''],[20,2,1,5,''],[21,2,1,5,''],[22,2,2,5,''],
            [18,7,2,1,''],[18,8,2,1,''],[18,9,2,1,''],[20,7,2,3,''],[22,7,2,3,''],
            [24,2,1,5,''],[25,2,3,1,''],[25,3,1,4,''],[26,3,1,4,''],[27,3,1,4,''],
            [24,7,1,3,''],[25,7,1,3,''],[26,7,1,3,''],[27,7,1,3,''],[28,7,1,3,''],
            [28,2,1,5,''],[29,2,3,8,'']
        ]
    SP_FORM = {
            'init_size' : (37,10),
            'slim_rows' : [3,5,8,17,32],
            'slim_cols' : [],
            'text_items' : {
                (1,0):[(2,5),"세그먼트 제조 지시서", ['title']],
                # --------------------------
                (4,0):[(1,2),"제조지시   NO.",['center','bold']],
                (4,5):[(1,2),"일         자",['center','bold']],
                (6,0):[(1,2),"세그먼트   NO.",['center','bold']],
                (7,0):[(1,2),"품         명",['center','bold']],
                (6,5):[(2,2),"수         량",['center','bold']],
                (9,0):[(2,2),"규         격",['center','bold']],
                (11,0):[(2,2),"본         드",['center','bold']],
                (13,0):[(4,2),"다이아몬드",['center','bold']],
                (18,0):[(2,2),"V\n소         결",['center','bold']],
                (18,7):[(2,1),"소   결\nTEST",['center','bold']],
                (20,0):[(2,2),"IV\n성         형",['center','bold']],
                (22,0):[(2,2),"III\n도         징",['center','bold']],
                (24,0):[(4,2),"II\n다  이  아\n믹      싱",['center','bold']],
                (28,0):[(4,2),"I\n분      말\n믹      싱",['center','bold']],
                (33,0):[(4,2),"기      타",['center','bold']],
                # --------------------------
                (6,9):[(1,1),"개",['left']],
                (7,9):[(1,1),"개",['left']],
                (10,6):[(1,1),"cc",['left']],
                (11,6):[(1,1),"g/cc",['left']],
                (12,6):[(1,1),"HRB",['left']],
                (15,6):[(1,1),"ct/cc",['left']],
                (18,6):[(1,1),"°C",['left']],
                (19,6):[(1,1),"min",['left']],
                (20,6):[(1,1),"bar",['left']],
                (21,6):[(1,1),"mm",['left']],
                (22,6):[(2,1),"g",['left']],
                (23,9):[(1,1),"g",['left']],
                (24,6):[(1,1),"g",['left']],
                (25,6):[(1,1),"g",['left']],
                (26,6):[(1,1),"g",['left']],
                (27,6):[(1,1),"g",['left']],
                (25,9):[(1,1),"g",['left']],
                (26,9):[(1,1),"g",['left']],
                (27,9):[(1,1),"시간",['left']],
                (28,9):[(1,1),"시간",['left']],
                # --------------------------
                (6,7):[(1,1),"NET",['center']],
                (7,7):[(1,1),"작업량",['center']],
                (9,2):[(1,1),"L",['center']],
                (9,3):[(1,1),"T",['center']],
                (9,4):[(1,1),"높이(W)",['center']],
                (9,5):[(1,2),"부피",['center']],
                (9,7):[(1,1),"[모형]",['center']],
                (11,4):[(1,1),"절대밀도",['center']],
                (12,4):[(1,1),"경      도",['center']],
                (13,3):[(1,2),"종류",['center']],
                (13,5):[(1,1),"비율",['center']],
                (13,6):[(1,1),"집중도",['center']],
                (14,2):[(1,1),"D1",['center']],
                (15,2):[(1,1),"D2",['center']],
                (16,2):[(1,1),"D3",['center']],
                (18,2):[(1,2),"온      도",['center']],
                (19,2):[(1,2),"시      간",['center']],
                (18,8):[(1,1),"이론밀도",['center']],
                (18,9):[(1,1),"기준(94%)",['center']],
                (20,2):[(1,2),"압      력",['center']],
                (24,2):[(1,1),"본드믹스",['center']],
                (25,2):[(3,1),"다이아\n몬드",['center']],
                (27,7):[(1,1),"믹   싱",['center']],
                (28,7):[(1,1),"볼   밀",['center']],
                (28,2):[(1,1),"본   드",['center']],
                (28,4):[(1,1),"작업량",['center']],
                (29,2):[(1,1),"분   말",['center']],
                (30,2):[(1,1),"구성비",['center']],
                (31,2):[(1,1),"혼합량",['center']],
                (29,9):[(1,1),"계",['center']],
                # --------------------------
                (7,2):[(1,3),"",['left','editable']], # 품명 통합
                (6,8):[(1,1),"",['right','editable']],
                (7,8):[(1,1),"",['right','editable']],
                (10,7):[(1,1),"",['right','editable']],
                (10,8):[(1,2),"",['right','editable']],
                (11,7):[(1,1),"",['right','editable']],
                (12,7):[(1,1),"",['right','editable']],
                (18,4):[(1,2),"",['right','editable']],
                (19,4):[(1,2),"",['right','editable']],
                (20,4):[(1,2),"",['right','editable']],
                (21,4):[(1,2),"",['right','editable']],
                (22,4):[(2,2),"",['right','editable']],
                (23,7):[(1,2),"",['right','editable']],
                (24,4):[(1,2),"",['right','editable']],
                (25,5):[(1,1),"",['right','editable']],
                (26,5):[(1,1),"",['right','editable']],
                (27,5):[(1,1),"",['right','editable']],
                (28,5):[(1,2),"",['right','editable']],
                # --------------------------
                (6,2):[(1,3),"",['left','editable']],
                (33,2):[(1,8),"",['left','editable']],
                (34,2):[(1,8),"",['left','editable']],
                (35,2):[(1,8),"",['left','editable']],
                (36,2):[(1,8),"",['left','editable']],
                # --------------------------
                (4,7):[(1,3),"", ['center','editable']],
                (11,7):[(6,3),"", ['center','editable']],
                (11,2):[(2,2),"", ['center','editable']],
                (14,3):[(1,2),"", ['center','editable']],
                (15,3):[(1,2),"", ['center','editable']],
                (16,3):[(1,2),"", ['center','editable']],
                (21,7):[(1,3),"", ['center','editable']],
                (25,3):[(1,2),"", ['center','editable']],
                (26,3):[(1,2),"", ['center','editable']],
                (27,3):[(1,2),"", ['center','editable']],
                # -------------------------------------------------------------------------------------------
                (0,6):[(3,1),"결\n\n재",['right']],
                # --------------------------
                (0,7):[(1,1),"담당",['center']],
                (0,8):[(1,1),"부서장",['center']],
                (0,9):[(1,1),"사장",['center']],
                (21,2):[(1,2),"성  형  높  이",['center','black','bold']],
                (20,7):[(1,3),"*부채꼴 충진 주의",['left']],
                (22,2):[(2,2),"다이아   믹스",['center','black','bold']],
                (22,7):[(1,3),"*다이아 없는 본드:",['left']],
                (24,7):[(1,3),"첨가제",['center']],
                # --------------------------
                (25,7):[(1,1),"ㅁ  징크", ['left']],
                (26,7):[(1,1),"ㅁ  파라핀", ['left']],
            },
        }
    SP_POS = {
            "sp_no1"                   : (4,2),  # 제조지시 NO. 1
            "sp_no2"                   : (4,3),  # 제조지시 NO. 2
            "sp_no3"                   : (4,4),  # 제조지시 NO. 3
            "creation_date"                          : (4,7),  # 일자
            "segment_no"                        : (6,2),  # 세그먼트 No.
            "product_name"                  : (7,2),  # 품명1
            "amount_net"                     : (6,8),  # 수량NET
            "amount_work"                    : (7,8),  # 수량작업량
            "specification_l"                : (10,2), # 규격L
            "specification_t"                : (10,3), # 규격T
            "specification_w"                : (10,4), # 규격높이(W)
            "specification_v"                : (10,5), # 부피
            "specification_model_text"        : (10,8), # 모형텍스트
            "specification_model_img"         : (11,7), # 모형이미지
            "bond_select"                    : (11,2), # 본드 본드선택
            "bond_abs_density"                : (11,5), # 본드 절대밀도
            "bond_hardness"                  : (12,5), # 본드 경도
            "diamond_dia1_name"                 : (14,3), # 다이아몬드 종류 D1
            "diamond_dia2_name"                 : (15,3), # 다이아몬드 종류 D2
            "diamond_dia3_name"                 : (16,3), # 다이아몬드 종류 D3
            "diamond_dia1_ratio"                : (14,5), # 다이아몬드 비율 D1
            "diamond_dia2_ratio"                : (15,5), # 다이아몬드 비율 D2
            "diamond_dia3_ratio"                : (16,5), # 다이아몬드 비율 D3
            "diamond_concent1"               : (14,6), # 다이아몬드 집중도1
            "diamond_concent2"               : (16,6), # 다이아몬드 집중도2
            "sint_temp"                      : (18,4), # 소결 온도
            "sint_time"                      : (19,4), # 소결 시간
            "sint_test_theo_density"           : (19,8), # 소결TEST 이론밀도
            "sint_test_benchmark"             : (19,9), # 소결TEST 기준94%
            "forming_pressure"               : (20,4), # 성형 압력
            "forming_height"                 : (21,4), # 성형 성형높이
            "dosing_diamix"                  : (22,4), # 도징 다이아믹스
            "dosing_bond"                    : (23,7), # 도징 다이아 없는 본드
            "diamixing_bondmix_name"             : (24,3), # 다이아믹싱 본드믹스1
            "diamixing_bondmix_amount"             : (24,4), # 다이아믹싱 본드믹스2
            "diamixing_dia1_name"               : (25,3), # 다이아믹싱 다이아몬드 종류 D1
            "diamixing_dia2_name"               : (26,3), # 다이아믹싱 다이아몬드 종류 D2
            "diamixing_dia3_name"               : (27,3), # 다이아믹싱 다이아몬드 종류 D3
            "diamixing_dia1_amount"             : (25,5), # 다이아믹싱 다이아몬드 무게 D1
            "diamixing_dia2_amount"             : (26,5), # 다이아믹싱 다이아몬드 무게 D2
            "diamixing_dia3_amount"             : (27,5), # 다이아믹싱 다이아몬드 무게 D3
            "diamixing_zinc_check"            : (25,7), # 다이아믹싱 징크체크
            "diamixing_paraffin_check"        : (26,7), # 다이아믹싱 파라핀체크
            "diamixing_zinc_amount"           : (25,8), # 다이아믹싱 징크무게
            "diamixing_paraffin_amount"       : (26,8), # 다이아믹싱 파라핀무게
            "diamixing_mixing_time"           : (27,8), # 다이아믹싱 믹싱시간
            "powdermixing_ballmill_time"      : (28,8), # 분말믹싱 볼밀시간
            "powdermixing_bond_name"              : (28,3), # 분말믹싱 본드
            "powdermixing_bond_amount"          : (28,5), # 분말믹싱 작업량
            "powdermixing_powder1_name"           : (29,3), # 분말믹싱 분말1
            "powdermixing_powder2_name"           : (29,4), # 분말믹싱 분말2
            "powdermixing_powder3_name"           : (29,5), # 분말믹싱 분말3
            "powdermixing_powder4_name"           : (29,6), # 분말믹싱 분말4
            "powdermixing_powder5_name"           : (29,7), # 분말믹싱 분말5
            "powdermixing_powder6_name"           : (29,8), # 분말믹싱 분말6
            "powdermixing_powder1_ratio"      : (30,3), # 분말믹싱 구성비1
            "powdermixing_powder2_ratio"      : (30,4), # 분말믹싱 구성비2
            "powdermixing_powder3_ratio"      : (30,5), # 분말믹싱 구성비3
            "powdermixing_powder4_ratio"      : (30,6), # 분말믹싱 구성비4
            "powdermixing_powder5_ratio"      : (30,7), # 분말믹싱 구성비5
            "powdermixing_powder6_ratio"      : (30,8), # 분말믹싱 구성비6
            "powdermixing_powder_total_ratio"  : (30,9), # 분말믹싱 구성비계
            "powdermixing_powder1_amount"     : (31,3), # 분말믹싱 혼합량1
            "powdermixing_powder2_amount"     : (31,4), # 분말믹싱 혼합량2
            "powdermixing_powder3_amount"     : (31,5), # 분말믹싱 혼합량3
            "powdermixing_powder4_amount"     : (31,6), # 분말믹싱 혼합량4
            "powdermixing_powder5_amount"     : (31,7), # 분말믹싱 혼합량5
            "powdermixing_powder6_amount"     : (31,8), # 분말믹싱 혼합량6
            "powdermixing_powder_total_amount" : (31,9), # 분말믹싱 혼합량계
            "memo1"                         : (33,2), # 기타1
            "memo2"                         : (34,2), # 기타2
            "memo3"                         : (35,2), # 기타3
            "memo4"                         : (36,2), # 기타4
        }    
    # --------------------------
    IP_BORDER = [
            [0,7,3,3,'bold'], [0,7,1,3,''], [0,8,3,1,''],
            [4,0,3,10,'bold'],[8,0,5,10,'bold'],[14,0,13,10,'bold'],[28,0,6,10,'bold'],[35,0,4,10,'bold'],
            [4,0,3,2,''],[8,0,1,5,''],[8,0,5,2,''], [15,0,4,2,''],[19,0,4,2,''],[23,0,4,2,''],
            [28,0,2,2,''],[30,0,2,2,''],[32,0,2,2,''],[35,0,4,2,''],
            [28,0,2,8,''],[30,0,2,8,''],[32,0,2,8,''],[35,0,4,8,''],
            [4,5,3,2,''],[5,5,2,5,''],[8,5,5,5,''],[14,0,1,6,''],[14,6,1,2,''],[14,8,1,2,''],
            [15,2,2,8,''],[15,6,2,2,''],[17,2,2,8,''],[17,6,2,2,''],
            [19,2,4,8,''],[19,6,4,2,''],[23,2,4,8,''],[23,6,4,2,''],
        ]
    IP_FORM = {
            'init_size' : (39,10),
            'slim_rows' : [3,7,13,27,34],
            'slim_cols' : [],
            'text_items' : {
                (1,0):[(2,5),"공구 제조 지시서", ['title']],
                (4,0):[(3,2),"제조지시   NO.",['center','bold']],
                (4,5):[(1,2),"작성일",['center','bold']],
                (5,5):[(2,2),"출고예정일",['center','bold']],
                (8,0):[(1,2),"제품명",['center','bold']],
                (9,0):[(4,2),"수량",['center','bold']],
                (14,0):[(1,6),"구성품",['center','bold']],
                (14,6):[(1,2),"수량",['center','bold']],
                (14,8):[(1,2),"비고",['center','bold']],
                (15,0):[(4,2),"세그멘트",['center','bold']],
                (19,0):[(4,2),"샹크",['center','bold']],
                (23,0):[(4,2),"기타",['center','bold']],
                (28,0):[(2,2),"용접",['center','bold']],
                (30,0):[(2,2),"드레싱",['center','bold']],
                (32,0):[(2,2),"페인트",['center','bold']],
                (35,0):[(4,2),"비고",['center','bold']],

                # # --------------------------
                (9,4):[(1,1),"개",['left']],
                (10,4):[(1,1),"개",['left']],
                (11,4):[(1,1),"개",['left']],
                (12,4):[(1,1),"개",['left']],
                (15,7):[(2,1),"개",['left']],
                (17,7):[(2,1),"개",['left']],
                (18,7):[(1,1),"개",['left']],
                (19,7):[(1,1),"개",['left']],
                (20,7):[(1,1),"개",['left']],
                (21,7):[(1,1),"개",['left']],
                (22,7):[(1,1),"개",['left']],
                (23,7):[(1,1),"개",['left']],
                (24,7):[(1,1),"개",['left']],
                (25,7):[(1,1),"개",['left']],
                (26,7):[(1,1),"개",['left']],
                (15,2):[(1,2),"세그멘트 NO.",['left']],
                (16,2):[(1,2),"(세그 제조지시 NO.)",['left']],
                (17,2):[(1,2),"세그멘트 NO.",['left']],
                (18,2):[(1,2),"(세그 제조지시 NO.)",['left']],
                # # --------------------------
                # (6,7):[(1,1),"NET",'center'],
                # # --------------------------
                (9,3):[(1,1),"",['right','editable']],
                (10,3):[(1,1),"",['right','editable']],
                (11,3):[(1,1),"",['right','editable']],
                (12,3):[(1,1),"",['right','editable']],
                (16,4):[(1,1),"",['right','editable']],
                (18,4):[(1,1),"",['right','editable']],
                (15,6):[(2,1),"",['right','editable']],
                (17,6):[(2,1),"",['right','editable']],
                (19,6):[(1,1),"",['right','editable']],                
                (20,6):[(1,1),"",['right','editable']],
                (21,6):[(1,1),"",['right','editable']],
                (22,6):[(1,1),"",['right','editable']],
                (23,6):[(1,1),"",['right','editable']],
                (24,6):[(1,1),"",['right','editable']],
                (25,6):[(1,1),"",['right','editable']],
                (26,6):[(1,1),"",['right','editable']],
                # # --------------------------
                (8,2):[(1,2),"",['left','editable']],
                (8,4):[(1,1),"",['left','editable']],
                (9,2):[(1,1),"",['left','editable']],
                (10,2):[(1,1),"",['left','editable']],
                (11,2):[(1,1),"",['left','editable']],
                (12,2):[(1,1),"",['left','editable']],
                (15,4):[(1,2),"",['left','editable']],
                (17,4):[(1,2),"",['left','editable']],
                (16,5):[(1,1),"",['left','editable']],
                (18,5):[(1,1),"",['left','editable']],
                (19,2):[(1,4),"",['left','editable']],             
                (20,2):[(1,4),"",['left','editable']],
                (21,2):[(1,4),"",['left','editable']],
                (22,2):[(1,4),"",['left','editable']],
                (23,2):[(1,4),"",['left','editable']],
                (24,2):[(1,4),"",['left','editable']],
                (25,2):[(1,4),"",['left','editable']],
                (26,2):[(1,4),"",['left','editable']],
                (28,2):[(1,8),"",['left','editable']],
                (29,2):[(1,8),"",['left','editable']],
                (30,2):[(1,8),"",['left','editable']],
                (31,2):[(1,8),"",['left','editable']],
                (32,2):[(1,8),"",['left','editable']],
                (33,2):[(1,8),"",['left','editable']],
                (35,2):[(1,8),"",['left','editable']],
                (36,2):[(1,8),"",['left','editable']],
                (37,2):[(1,8),"",['left','editable']],
                (38,2):[(1,8),"",['left','editable']],
                # # --------------------------
                (4,2):[(2,1),"", ['center','editable']],
                (4,3):[(2,2),"", ['center','editable']],
                (4,7):[(1,3),"", ['center','editable']],
                (6,2):[(1,3),"", ['center','editable']],
                (5,7):[(2,3),"", ['center','editable']],
                (8,5):[(5,5),"", ['center','editable']],

                (15,8):[(2,1),"", ['center','editable']],
                (17,8):[(2,1),"", ['center','editable']],
                (15,9):[(2,1),"", ['center','editable']],
                (17,9):[(2,1),"", ['center','editable']],
                (19,8):[(4,1),"", ['center','editable']],
                (19,8):[(4,1),"", ['center','editable']],
                (19,9):[(4,1),"", ['center','editable']],   
                # --------------------------
                (0,6):[(3,1),"결\n\n재",['right']],
                (0,7):[(1,1),"담당",['center']],
                (0,8):[(1,1),"부서장",['center']],
                (0,9):[(1,1),"사장",['center']],
            },
        }
    IP_POS = {
            "ip_no1" :     (4,2),  # 제조지시 NO. 1
            "ip_no2" :     (4,3),  # 제조지시 NO. 2
            "ip_no3" :     (6,2),  # 제조지시 NO. 3
            "creation_date" :            (4,7),  # 작성일
            "due_date" :         (5,7),  # 출고예정일
            # --------------------------                               
            "item_group_name" :    (8,2),  # 제품명1
            "item1_name" :        (9,2),  # 탭1
            "item1_amount" :      (9,3),  # 탭1 수량
            "item2_name" :        (10,2), # 탭2
            "item2_amount" :      (10,3), # 탭2 수량
            "item3_name" :        (11,2), # 탭3
            "item3_amount" :      (11,3), # 탭3 수량
            "item4_name" :        (12,2), # 탭4
            "item4_amount" :      (12,3), # 탭4 수량         
            "image" :           (8,5),   # 이미지
            # --------------------------                               
            "seg1_no" :          (15,4), # 세그먼트 NO.
            "seg1_sp_no" :      (16,4),  # 세그먼트 제조지시서
            "seg1_amount" :      (15,6), # 세그먼트 수량
            "seg1_memo1" :       (15,8), # 세그먼트 비고1
            "seg1_memo2" :       (15,9), # 세그먼트 비고2       
            "seg2_no" :          (17,4),  # 세그먼트 NO.          
            "seg2_sp_no" :      (18,4),  # 세그먼트 제조지시서
            "seg2_amount" :      (17,6),  # 세그먼트 수량        
            "seg2_memo1" :       (17,8),  # 세그먼트 비고1        
            "seg2_memo2" :       (17,9),  # 세그먼트 비고2
            # --------------------------                               
            "shank1_name" :      (19,2),  # 샹크  
            "shank1_amount":     (19,6),  # 샹크 수량  
            "shank2_name" :      (20,2),  # 샹크  
            "shank2_amount":     (20,6),  # 샹크 수량  
            "shank3_name" :      (21,2),  # 샹크  
            "shank3_amount":     (21,6),  # 샹크 수량  
            "shank4_name" :      (22,2),  # 샹크  
            "shank4_amount":     (22,6),  # 샹크 수량  
            "shank_memo1" :     (19,8),  # 샹크 비고1
            "shank_memo2" :     (19,9),  # 샹크 비고2
            # --------------------------                               
            "sub1_name" :     (23,2),  # 기타
            "sub1_amount" :   (23,6),  # 기타 수량
            "sub1_memo1" :    (23,8),  # 기타 비고1
            "sub1_memo2" :    (23,9),  # 기타 비고2
            "sub2_name" :     (24,2),  # 기타
            "sub2_amount" :   (24,6),  # 기타 수량
            "sub2_memo1" :    (24,8),  # 기타 비고1
            "sub2_memo2" :    (24,9),  # 기타 비고2
            "sub3_name" :     (25,2),  # 기타
            "sub3_amount" :   (25,6),  # 기타 수량
            "sub3_memo1" :    (25,8),  # 기타 비고1
            "sub3_memo2" :    (25,9),  # 기타 비고2
            "sub4_name" :     (26,2),  # 기타
            "sub4_amount" :   (26,6),  # 기타 수량
            "sub4_memo1" :    (26,8),  # 기타 비고1
            "sub4_memo2" :    (26,9),  # 기타 비고2       
            # --------------------------                 
            "welding1" :        (28,2),  # 용접1
            "welding2" :        (29,2),  # 용접2
            "dressing1" :       (30,2),  # 드레싱1
            "dressing2" :       (31,2),  # 드레싱2
            "paint1" :          (32,2),  # 페인트1
            "paint2" :          (33,2),  # 페인트2
            "memo1" :           (35,2),  # 비고1
            "memo2" :           (36,2),  # 비고2
            "memo3" :           (37,2),  # 비고3
            "memo4" :           (38,2),  # 비고4
        }    
    # -------------------------------------------------------------------------------------------

